Repository: charettes/api-docs
Catalog: source/locale/*/LC_MESSAGES/topics/errors.po
Languages: fr

source: Errors
fr: Erreurs

source: Client errors
fr: Erreurs client

source: When an HTTP request to the API is malformed a response with a ``4XX`` status code is returned.
fr: Lorsqu'une requête HTTP à l'API est malformée une réponse dont le code de statut est ``4XX`` est retourné.

source: The request is invalid. If you attempted to modify or create a resource it's possible the request body contains invalid data (e.g. a required field is missing, an email field is invalid, ...). The response body should contain more details about the origins of the error.
fr: Si vous tentiez de modifier ou de créer une ressource il est possible que les données fournies soit invalide (Un champs requis manquant, une adresse courriel invalide, …). Référez vous au corps de la réponse pour plus de détails.

source: The provided credentials are invalid. Refer to the :ref:`authentication<authentication>` section for troubleshooting.
fr: Les données d'authentifications sont invalides. Référez-vous à la section :ref:`authentification<authentication>` pour plus de détails.

source: The alteration of the specified resource is conflictual. More details should be available from the response body and a conflict resolution strategy should be detailed in the specified :ref:`resource<resources>` documentation.
fr: La tentative d'altération de la ressource cause un conflit. Plus de détails devraient être disponible dans le corps de la réponse et une stratégie de résolution du conflit devrait être exposée via la documentation de la :ref:`ressource<resources>` concernée.

source: Server errors
fr: Erreurs serveur

source: When Emailicious' servers cannot treat your request adequately a response with a ``5XX`` status code is returned. Such instances should be rare and intermittent and you should contact our `support team`_ if the problem persists.
fr: Lorsque les serveurs d'Emailicious ne sont pas en mesure de traiter une requête adéquatement une réponse dont le code de statut est ``5XX`` est retournée. De telles occurrences sont rares et intermittentes et vous devriez contacter notre `équipe de support`_ si le problème devait persister.

source: Emailicious' servers encountered an undisclosed internal error processing your request and our engineers are working toward fixing the underlying issue. The response should contain an :http:header:`X-Sentry-ID` header containing a `UUID`_ identifying your request that might be requested by Emailicious' `support team`_.
fr: Les serveurs d'Emailicious ont rencontré un problème lors du traitement de votre requête et nos développeurs travaillent à le résoudre. La réponse retournée devraient contenir une entête :http:header:`X-Sentry-ID` contenant un `UUID`_ identifiant votre requête. Le contenu de cette entête pourrait vous être demandé par notre `équipe de support`_.

source: The specified resource doesn't exist or is not accessible anymore. You should make sure the specified `URI`_ is valid.
fr: La ressource spécifée n'existe pas ou n'est plus accessible. Assurez-vous que l'`URI`_ spécifiée est bien valide.
