Repository: charettes/api-docs
Catalog: source/locale/*/LC_MESSAGES/ressources.po
Languages: fr

source: Endpoints
fr: Ressources

source: Localization
fr: Localisation

source: Languages
fr: Langues

source: List of supported `ISO-639-1 language codes`_.
fr: Liste des `codes de langues ISO-639-1`_ supportées.

source: **Request**:
fr: **Requête**:

source: **Response**:
fr: **Réponse**:

source: Regions
fr: Régions

source: List of supported `ISO-3166-1 country codes`_ and `ISO-3166-2 country subdivision codes`_.
fr: Liste des `codes de pays ISO-3166-1`_ et `codes de subdivision de pays ISO-3166-2`_ supportés.

source: filter results by ``code``.
fr: filtre les résultats par ``code``.

source: filter results by ``name`` and country ``name``.
fr: filtre les résultats par ``name`` et ``name`` de leur pays associé.

source: Details of the region matching the specified ``code``.
fr: Détails the la région correspondant au ``code`` spécifié.

source: `ISO-3166` country or subdivision code.
fr: Code de pays ou de subdivision `ISO-3166`.
