Repository: charettes/api-docs
Catalog: source/locale/*/LC_MESSAGES/topics.po
Languages: fr

source: Accessing resources exposed through the API requires explicit authentication.
fr: L'accés aux ressources exposées via l'API requiert une authentication préablable

source: All requests must include an :http:header:`Authorization` header in order to perform `HTTP basic access authentication`_ using an existing username and password as credentials.
fr: Toutes les requêtes doivent inclure un entête :http:header:`Authorization` afin de permettre `une authentication basic HTTP`_ à partir d'un nom d'usager existant et son mot de passe associé.

source: Failing to provide valid credentials will result in an :http:statuscode:`401` response.
fr: À défaut de fournir des données d'authentication valide une réponse :http:statuscode:`401` sera retournée.

source: Topics
fr: Sujets

source: Localization
fr: Localisation

source: Certain resources content is localized using `content negotiation`_ based on the :http:header:`Accept-Language` header.
fr: Le contenu de certaines ressources est localisé via `negotiation de contenu`_ à partir de l'entête :http:header:`Accept-Language`.

source: For example, the :http:get:`/api/v1/regions` resource will return localized ``name`` if a language is specified through the aforementioned header.
fr: Par exemple, la ressource :http:get:`/api/v1/regions` retournera un ``name`` localisé si une locale est spécifiée via l'entête mentionné précédemment.

source: Authentication
fr: Authentification

source: Emailicious usernames contain the "@" character which is also used as the `credential` and `host` separator of an `URI`_. Most HTTP clients make sure to `percent-encode`_ the `username` and `password` part but you might have to replace this character by `%40` if it's not the case.
fr: Les noms d'usager Emailicious contiennent le caractère « @ » qui est aussi utilisé comme séparateur des sections `credentials` et `host` d'une `URI`_. La plupart des clients HTTP s'assurent d'appliquer l'`encodage-pourcentage`_ au `nom d'usager` ainsi qu'au `mot de passe` mais il est possible que vous deviez effectuer la substitution vous même si ce n'est pas le cas.

source: For example, the `cURL`_ command line tool requires manual replacement::
fr: Par exemple, l'outil de ligne de commande `cURL`_ requiert telle manipulation::

source: If the :http:header:`Accept-Language` header is not provided the current locale will be determined from the :ref:`authenticated user <authentication>` language if defined.
fr: Si l'entête :http:header:`Accept-Language` n'est pas fournie la locale du contenu sera déterminée à partir de la langue associé à l':ref:`utilisateur authentifié <authentication>`.

source: `Emailicious`_ API exposes a collection of :ref:`resources <resources>` through an HTTP `REST`_ interface.
fr: L'API d'`Emailicious`_ expose une collection de :ref:`ressources <resources>` via un interface HTTP `REST`_.

source: The API root is accessible at the ``/api/v1`` path of all existing `Emailicious`_ accounts::
fr: La racine de l'API est exposée au chemin ``/api/v1`` de chaque compte `Emailicious`_ existant::
