Repository: charettes/api-docs
Catalog: source/locale/*/LC_MESSAGES/resources/lists.po
Languages: fr

source: Lists
fr: Listes

source: List of existing subscriber lists.
fr: Liste des listes d'abonnés existantes.

source: **Request**:
fr: **Requête**:

source: **Response**:
fr: **Réponse**:

source: Create a new subscriber list.
fr: Crée une nouvelle liste d'abonnés.

source: list created
fr: liste crée

source: invalid request body
fr: requête invalide

source: list's unique identifier
fr: l'identifiant unique de la liste

source: list's creation datetime
fr: le `datetime` de création de la liste

source: list's creation :ref:`user <authentication>`'s unique identifier
fr: l'identifiant unique du :ref:`créateur <authentication>` de la liste

source: list's last update datetime
fr: le `datetime` de dernière modification de la liste

source: list's name
fr: le nom de la liste

source: list's last update :ref:`user <authentication>`'s unique identifier
fr: l'identifiant unique de l':ref:`utilisateur <authentication>` ayant fait la dernière modification à a liste

source: list's future mailings' default "from name"
fr: le nom d'expéditeur par défaut des envois futurs à cette liste

source: list's future mailings' default "from email"
fr: l'adresse d'expédition par défaut des envois futurs à cette liste

source: list's the future mailings' default "reply to email"
fr: l'adresse de retour par défaut des envois futurs à cette liste

source: list's default :ref:`language<languages>`
fr: la :ref:`langue<languages>` par défaut de la liste

source: list's allowed :ref:`languages<languages>`
fr: les :ref:`langues<languages>` permise par la liste

source: Details of the list matching the specified ``id``.
fr: Détails de la liste correspondant au ``id`` spécifié.

source: no list match the specified ``id``
fr: aucune liste ne correspond au ``id`` spécifié
