Repository: charettes/api-docs
Catalog: source/locale/*/LC_MESSAGES/resources/regions.po
Languages: fr

source: Regions
fr: Régions

source: **Request**:
fr: **Requête**:

source: **Response**:
fr: **Réponse**:

source: Details of the region matching the specified ``code``.
fr: Détails de la région correspondant au ``code`` spécifié.

source: filter results by ``code``
fr: filtre les résultats par ``code``

source: filter results by ``name`` and country ``name``
fr: filtre les résultats par ``name`` et ``name`` de leur pays associé

source: :ref:`localized<localization>` name of the country or subdivision
fr: nom :ref:`localisé<localization>` du pays ou de la subdivision

source: List of supported `ISO-3166-1`_ country and `ISO-3166-2`_ subdivision codes.
fr: Liste des codes de pays `ISO-3166-1`_ et subdivisions `ISO-3166-2`_ supportés.

source: `ISO-3166`_ code of the country or subdivision
fr: code `ISO-3166`_ du pays ou de la subdivision

source: `ISO-3166`_ country or subdivision code.
fr: Code de pays ou de subdivision `ISO-3166`_.

source: `ISO-3166-1`_ code of the subdivision's country
fr: code `ISO-3166-1`_ du pays de la subdivision

source: `ISO-3166-2`_ codes and :ref:`localized<localization>` names of the country's subdivisions
fr: codes `ISO-3166-2`_ et noms :ref:`localisés<localization>` des subdivisions du pays
