Repository: charettes/api-docs
Catalog: source/locale/*/LC_MESSAGES/resources/subscribers.po
Languages: fr

source: Subscribers
fr: Abonnés

source: Subscribers of the list matching the specified ``list_id``.
fr: Abonnés de la liste correspondant au ``list_id`` spécifié.

source: list's unique identifier
fr: l'identifiant unique de la liste

source: filter results by ``subscription`` status, valid values are ``active``, ``pending``, ``bounced``, ``unsubscribed`` and ``deleted``
fr: filtrer les résultats par statut d'abonnement, les valeurs valides sont ``active``, ``pending``, ``bounced``, ``unsubscribed`` and ``deleted``

source: filter results by ``email``
fr: filtrer les résultats par ``email``

source: subscriber's unique identifier
fr: l'identifiant unique de la liste

source: subscriber's creation datetime
fr: le `datetime` de création de l'abonné

source: subscriber's creation :ref:`user <authentication>`'s unique identifier
fr: l'identifiant unique du :ref:`créateur<authentication>`'s de l'abonné

source: subscriber's last update datetime
fr: le `datetime` de dernière modification de l'abonné

source: subscriber's last update :ref:`user <authentication>`'s unique identifier
fr: L'identifiant unique de l':ref:`utilisateur<authentication>` ayant fait la dernière modification à l'abonné

source: subscriber's subscription status
fr: statut d'abonnement de l'abonné

source: subscriber's first name
fr: prénom de l'abonné

source: subscriber's last name
fr: nom de l'abonné

source: subscriber's gender
fr: sexe de l'abonné

source: subscriber's date of birth
fr: date de naissance de l'abonné

source: subscriber's :ref:`language<languages>`
fr: :ref:`langue<languages>` de l'abonné

source: subscriber's :ref:`region<regions>`
fr: :ref:`région<regions>` de l'abonné

source: Custom shared and list fields should also be part of the subscriber objects. The exact structure of the list can be retrieved by :ref:`introspecting<custom-fields-instropection>` the resource.
fr: Les champs personnalisés partagés et de listes devraient aussi être présent dans les abonnés retournés. La structure exacte de la liste peut être retrouvée par :ref:`introspection<custom-fields-instropection>` de la ressource.

source: **Request**:
fr: **Requête**:

source: **Response**:
fr: **Réponse**:

source: no subscriber list match the specified ``list_id``
fr: aucune liste d'abonnés ne correspond au ``list_id`` spécifié

source: Create subscriber for the list matching the specified ``list_id``.
fr: Crée un abonné à la liste correspondant au ``list_id`` spécifié.

source: Custom shared and list fields can also be specified as parameters. The exact structure of the list can be retrieved by :ref:`introspecting<custom-fields-instropection>` the resource.
fr: Les champs personnalisés partagés et de listes peuvent aussi être spécificiés comme paramètres. La structure exacte de la liste peut être retrouvée par :ref:`introspection<custom-fields-instropection>` de la ressource.

source: the subscriber was created successfully
fr: l'abonné a été créé avec succès

source: invalid subscriber data
fr: données d'abonné invalides

source: a subscriber with the specified ``email`` :ref:`already exists in this list<email-conflict>`.
fr: un abonné avec l'adresse courriel spécifée :ref:`existe déjà dans cette liste<email-conflict>`.

source: Dealing with :http:statuscode:`409`
fr: Gérer les erreurs :http:statuscode:`409`

source: When a list already contains a subscriber with the specified ``email`` the conflicting subscriber will be returned in the body of a :http:statuscode:`409` response.
fr: Lorsqu'une tentative de création ou de modification d'un abonné entraîne une collision du champ adresse courriel l'abonné conflictuel est retourné dans le corps d'une réponse :http:statuscode:`409`.

source: Introspection details of the subscribers resource.
fr: Détails introspectif de la ressource « abonnés ».

source: Custom fields introspection
fr: Introspection des champs personnalisés

source: You can use the ``actions.POST`` details to retrieve the name and type of custom fields from the specified ``list_id`` structure.
fr: Vous pouvez retrouver le nom et type des champs personnalisés de la liste spécifié à partir de la section ``actions.POST`` de la réponse.

source: Details of the subscriber matching the specified ``list_id`` and ``id``.
fr: Détails de l'abonné correspondant aux ``list_id`` et ``id`` spécifiés.

source: Custom shared and list fields should also be part of the subscriber object. The exact structure of the list can be retrieved by :ref:`introspecting<custom-fields-instropection>` the resource.
fr: Les champs personnalisés partagés et de listes devraient aussi être présent dans l'abonné retourné. La structure exacte de la liste peut être retrouvée en :ref:`introspectant<custom-fields-instropection>` la ressource.

source: no subscriber match the specified ``list_id`` and ``id``
fr: aucun abonné ne correspond aux ``list_id`` et ``id`` spécifiés.

source: Alter the subscriber matching the specified ``id`` and ``list_id``.
fr: Modifie l'abonné correspondant aux ``list_id`` et ``id`` spécifiés.

source: Partially alter the subscriber matching the specified ``id`` and ``list_id``.
fr: Modification partielle de l'abonné correspondat aux ``list_id`` et ``id`` spécifiés.

source: Change the ``subscription`` status of the subscriber matching the provided ``id`` and ``list_id`` to ``deleted``.
fr: Assigne le statut d'abonnement ``deleted`` à l'abonné correspondant aux ``list_id`` et ``id`` spécifiés

source: the subscriber was deleted successfully
fr: le statut d'abonnement de l'abonné à été modifié avec succès

source: Change the ``subscription`` status of the subscriber matching the provided ``id`` and ``list_id`` to either ``pending`` or ``active`` depending on the list's subscription process and the value of the ``confirm`` parameter.
fr: Assigne le statut d'abonnement ``pending`` ou ``active`` à l'abonné correspondant aux ``list_id`` et ``id`` spécifiés en fonction du processus d'adhésion de la liste ainsi que la valeur du paramètre ``confirm``.

source: whether or not to force or disable activation confirmation
fr: outrepasse le processus d'adhésion configuré

source: the subscriber's subscription status
fr: le statut d'abonnement de l'abonné

source: the subscription activation cannot be confirmed since not opt-in process is configured for the specified list.
fr: il n'est pas possible de confirmer l'abonnement à la liste puisqu'aucun processus n'est configuré

source: Change the ``subscription`` status of the subscriber matching the provided ``id`` and ``list_id`` to ``unsubscribed``.
fr: Assigne le statut d'abonnement ``unsubscribed`` à l'abonné correspondant aux ``list_id`` et ``id`` spécifiés

source: subscriber's email
fr: l'adresse courriel de l'abonné

source: At this point your application should either notify the user behind the request that this ``email`` is already subscribed or proceed to :ref:`update the conflicting subscriber<subscriber-update>` given you authenticated the user as the owner of the specified ``email`` address.
fr: Lorsqu'un tel conflit se produit votre application se doit d'informer l'utilisateur à la source de la requête que ce ``email`` est déjà abonné à la liste de diffusion ou bien procéder à la :ref:`mise à jour de l'abonné conflictuel<subscriber-update>` si l'utilisateur à préalablement prouvé qu'il était bien le propriétaire de l'adresse en question.

source: Note that that a conflict may occur even if the subscriber previously unsubscribed or was deleted from the specified list. You might want to take different action based on the returned ``subscription`` status and your application's business logic such as :ref:`confirming the re-activation<subscription-activation>`.
fr: Notez qu'un tel conflit peut également se produire lorsqu'un abonné s'est préalablement désinscrit ou a été supprimé d'une liste. La marche à suivre dans ces cas dépend entièrement de votre logique applicative. Par exemple, vous pourriez vouloir :ref:`confirmer le réabonnement<subscription-activation>` ou bien simplement ignorer telles exceptions.
